Donkey-Hash/-/0429重新/nanoWAys20240724改单片机+测润泽/Bsp/src/stm32f4flashopt.c
#include <stdbool.h>
#include "stm32f4flashopt.h"

//读取指定地址的字(32位数据) 
//faddr:读地址 
//返回值:对应数据.
uint32_t Stm32ReadWord(uint32_t faddr)
{
	return *(uint32_t*)faddr; 
}

//获取某个地址所在的flash扇区
//addr:flash地址
//返回值:0~11,即addr所在的扇区
static uint8_t Stm32F4GetFlashSector(uint32_t addr)
{
			 if(addr<ADDR_FLASH_SECTOR_1)return FLASH_SECTOR_0;
	else if(addr<ADDR_FLASH_SECTOR_2)return FLASH_SECTOR_1;
	else if(addr<ADDR_FLASH_SECTOR_3)return FLASH_SECTOR_2;
	else if(addr<ADDR_FLASH_SECTOR_4)return FLASH_SECTOR_3;
	else if(addr<ADDR_FLASH_SECTOR_5)return FLASH_SECTOR_4;
	else if(addr<ADDR_FLASH_SECTOR_6)return FLASH_SECTOR_5;
	else if(addr<ADDR_FLASH_SECTOR_7)return FLASH_SECTOR_6;
	else if(addr<ADDR_FLASH_SECTOR_8)return FLASH_SECTOR_7;
	else if(addr<ADDR_FLASH_SECTOR_9)return FLASH_SECTOR_8;
	else if(addr<ADDR_FLASH_SECTOR_10)return FLASH_SECTOR_9;
	else if(addr<ADDR_FLASH_SECTOR_11)return FLASH_SECTOR_10; 
	else if(addr<ADDR_FLASH_SECTOR_12)return FLASH_SECTOR_11; 
//	else if(addr<ADDR_FLASH_SECTOR_13)return FLASH_SECTOR_12; 
//	else if(addr<ADDR_FLASH_SECTOR_14)return FLASH_SECTOR_13; 
//	else if(addr<ADDR_FLASH_SECTOR_15)return FLASH_SECTOR_14; 
//	else if(addr<ADDR_FLASH_SECTOR_16)return FLASH_SECTOR_15; 
//	else if(addr<ADDR_FLASH_SECTOR_17)return FLASH_SECTOR_16; 
//	else if(addr<ADDR_FLASH_SECTOR_18)return FLASH_SECTOR_17; 
//	else if(addr<ADDR_FLASH_SECTOR_19)return FLASH_SECTOR_18; 
//	else if(addr<ADDR_FLASH_SECTOR_20)return FLASH_SECTOR_19; 
//	else if(addr<ADDR_FLASH_SECTOR_21)return FLASH_SECTOR_20; 
//	else if(addr<ADDR_FLASH_SECTOR_22)return FLASH_SECTOR_21; 
//	else if(addr<ADDR_FLASH_SECTOR_23)return FLASH_SECTOR_22;  
//	return FLASH_SECTOR_23;	
}
//获取某个地址所在的flash扇区内存大小
//addr:flash地址
//返回值:0~11,即addr所在的扇区
uint32_t Stm32F4GetSector(uint8_t sector)
{
	switch(sector)
	{
		case FLASH_SECTOR_0:
		case FLASH_SECTOR_1:
		case FLASH_SECTOR_2:
		case FLASH_SECTOR_3:
//		case FLASH_SECTOR_12:
//		case FLASH_SECTOR_13:
//		case FLASH_SECTOR_14:
//		case FLASH_SECTOR_15:
			return 16*1024;
		case FLASH_SECTOR_4:
//		case FLASH_SECTOR_16:
			return 64*1024;
		default:
			return 128*1024;					
	}
}

//从指定地址开始写入指定长度的数据
//特别注意:因为STM32F4的扇区实在太大,没办法本地保存扇区数据,所以本函数
//         写地址如果非0XFF,那么会先擦除整个扇区且不保存扇区数据.所以
//         写非0XFF的地址,将导致整个扇区数据丢失.建议写之前确保扇区里
//         没有重要数据,最好是整个扇区先擦除了,然后慢慢往后写. 
//该函数对OTP区域也有效!可以用来写OTP区!
//OTP区域地址范围:0X1FFF7800~0X1FFF7A0F(注意：最后16字节，用于OTP数据块锁定，别乱写！！)
//WriteAddr:起始地址(此地址必须为4的倍数!!)
//pBuffer:数据指针
//NumToWrite:字(32位)数(就是要写入的32位数据的个数.) 
HAL_StatusTypeDef Stm32f4WriteWords(uint32_t WriteAddr,uint32_t *pBuffer,uint32_t NumToWrite)	
{ 
	FLASH_EraseInitTypeDef FlashEraseInit;
	HAL_StatusTypeDef FlashStatus=HAL_OK;
	uint32_t SectorError=0;
	uint32_t addrx=0;
	uint32_t endaddr=0;	
	if(WriteAddr<STM32_FLASH_BASE||WriteAddr%4)return HAL_BUSY;	//非法地址
    
	HAL_FLASH_Unlock();             //解锁	
	addrx=WriteAddr;				//写入的起始地址
	endaddr=WriteAddr+NumToWrite*4;	//写入的结束地址
    
	if(addrx<0X1FFF0000)
	{
		while(addrx<endaddr)		//扫清一切障碍.(对非FFFFFFFF的地方,先擦除)
		{
			if(Stm32ReadWord(addrx)!=0XFFFFFFFF)//有非0XFFFFFFFF的地方,要擦除这个扇区
				{   
					FlashEraseInit.TypeErase=FLASH_TYPEERASE_SECTORS;       //擦除类型，扇区擦除 
					FlashEraseInit.Sector=Stm32F4GetFlashSector(addrx);   //要擦除的扇区
					FlashEraseInit.NbSectors=1;                             //一次只擦除一个扇区
					FlashEraseInit.VoltageRange=FLASH_VOLTAGE_RANGE_3;      //电压范围，VCC=2.7~3.6V之间!!
					if(HAL_FLASHEx_Erase(&FlashEraseInit,&SectorError)!=HAL_OK) 
						break;
				}
				else 
					addrx+=4;
				FLASH_WaitForLastOperation(FLASH_WAITETIME);                //等待上次操作完成
		}
	}
	FlashStatus=FLASH_WaitForLastOperation(FLASH_WAITETIME);            //等待上次操作完成
	if(FlashStatus==HAL_OK)
	{
		 while(WriteAddr<endaddr)//写数据
		 {
			if(HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD,WriteAddr,*pBuffer)!=HAL_OK)//写入数据
				return HAL_ERROR;
			WriteAddr+=4;
			pBuffer++;
		}  
	}
	HAL_FLASH_Lock();           //上锁
	return HAL_OK;
} 

//从指定地址开始读出指定长度的数据
//ReadAddr:起始地址
//pBuffer:数据指针
//NumToRead:字(32位)数
void Stm32f4ReadWords(uint32_t ReadAddr,uint32_t *pBuffer,uint32_t NumToRead)   	
{
	uint32_t i;
	for(i=0;i<NumToRead;i++)
	{
		pBuffer[i]=Stm32ReadWord(ReadAddr);//读取4个字节.
		ReadAddr+=4;//偏移4个字节.	
	}
}

//////////////////////////////////////////测试用///////////////////////////////////////////
//WriteAddr:起始地址
//WriteData:要写入的数据
void TestWrite(uint32_t WriteAddr,uint32_t WriteData)   	
{
	Stm32f4WriteWords(WriteAddr,&WriteData,1);//写入一个字 
}
